//Задание 1
var rageexp = /^[a-z]{3,10}_[a-z]{3,10}(\-[0-9]{4})?@[a-z0-9]{1,10}((\-)|(\.))?[a-z0-9]{1,10}(.com)$/.test('name_surname-1234@gmail.com');

//Задание 2
var rageexp2 = /^(\+)?((375(\-)?(25|29|33|44|17))|(8(\-)?0(25|29|33|44|17)))(\-)?[1-9]{3}(\-)?[1-9]{2}(\-)?[1-9]{2}$/.test('8-0447777777');

//Задание 3
var str = 'хлеб всему голова';

var result = str.match( /[аяоёуюыиеaeiouy]{1,}/gi );

if (result) {
    console.log('Кол-во гласных: ' + result.length);
} else {
    console.log('Здесь нет гласных');
}